utiles/TestPlan30.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan 30">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">60</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <longProp name="ThreadGroup.duration">180</longProp>
        <longProp name="ThreadGroup.delay">1</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/task</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;name&quot;: &quot;Sample message content&quot;,&#xd;
  &quot;author&quot;: &quot;Candy Diaz&quot;,&#xd;
  &quot;telephone&quot;: &quot;999235234&quot;,&#xd;
  &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
  &quot;description&quot;: &quot;web-app&quot;,&#xd;
  &quot;publisher&quot;: &quot;topico&quot;,&#xd;
  &quot;version&quot;: &quot;v10&quot;,&#xd;
  &quot;created_at&quot;: &quot;2023-05-18T14:29:26.384Z&quot;,&#xd;
  &quot;updated_at&quot;: &quot;2023-05-18T14:29:26.384Z&quot;,&#xd;
  &quot;tasks&quot;: [&#xd;
    {&#xd;
      &quot;idTask&quot;: 1,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 2,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 3,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 4,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 5,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 6,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 7,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 8,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 9,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    },&#xd;
        {&#xd;
      &quot;idTask&quot;: 10,&#xd;
      &quot;nameTask&quot;: &quot;Cocinar&quot;,&#xd;
      &quot;assigned&quot;: &quot;Tania Diaz&quot;,&#xd;
      &quot;dni&quot;: &quot;99235234&quot;,&#xd;
      &quot;email&quot;: &quot;candy@email.com&quot;,&#xd;
      &quot;description&quot;: &quot;Preparar alm uerzo&quot;,&#xd;
      &quot;informer&quot;: &quot;Administrador o jefe&quot;,&#xd;
      &quot;timeTask&quot;: 10&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Gestor de Cabecera HTTP" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <PreciseThroughputTimer guiclass="TestBeanGUI" testclass="PreciseThroughputTimer" testname="Precise Throughput Timer">
          <doubleProp>
            <name>allowedThroughputSurplus</name>
            <value>1.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
          <intProp name="batchSize">30</intProp>
          <intProp name="batchThreadDelay">0</intProp>
          <longProp name="duration">180</longProp>
          <intProp name="exactLimit">10000</intProp>
          <longProp name="randomSeed">0</longProp>
          <doubleProp>
            <name>throughput</name>
            <value>30.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
          <intProp name="throughputPeriod">1</intProp>
        </PreciseThroughputTimer>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Árbol de Resultados">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">D:\RESPALDO\BACKUP_MASTER_JDC\PROGRAMAS\IDES_BD_PROGRAMACION\JAVA_ALL_IDES\JMETER\report.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>